[
  {
    "id": "01",
    "date": "2021-08-21",
    "title": "Winner – Innovative Use of Technology Marketing Award",
    "image": "/news/The-Marketing-Society_Linkedin-2-01-1-1024x1024.jpg",
    "content": "We are delighted to share our success in winning a coveted global award for innovation, for our Hong Kong Observation Wheel &amp; AIA Vitality Park AR App, presented by AIA. Awarded by the globally accredited The Marketing Society at this year’s award ceremony took place in London recently.<br><br>Presenting periods of Hong Kong developments of the past, overlayed within the current landscape, The <a href=\"https://hkow.hk/ar-app/\" target=\"_blank\" rel=\"noopener\"><span style=\"color: #1f78ad;\">Hong Kong Observation Wheel Augmented Reality App</span></a> Presented by AIA was conceptualized to enhance customer experience and appeal to generations of Hong Kong locals, expatriates, and visitors, by evoking an emotional response to the Hong Kong harbour’s enchanting history and development.<br><br>Through augmented reality, the app transports users back in time with layered digital visuals and interactive features. The mobile phone app is the first of its kind - worldwide - integrating a variety of modern immersive reality content to be developed for use on a rotating platform. This presented many technical challenges which required the collaboration and ingenuity of experts from around the world.<br><br>We wish to thank all of our partners in helping us realise the vision we had for this remarkable app. <br><br>AIA <br>Great Entertainment Group <br>The Entertainment Corporation Limited<br>Zspace Hong Kong <br>Maritime Museum <br>Shadow Factory <br>Sinclair Comms <br>Kite Systems <br>Zebrar<br>And special thanks to our two historians who consulted for us through this project – Kim Ko Keung and Jason Wordie."
  },
  {
    "id": "02",
    "date": "2019-11-25",
    "title": "5th International & Bilingual Schools China Conference",
    "image": "/news/0-1-1-1024x658.jpeg",
    "content": "We are fresh back from the 5th Annual International & Bilingual Schools China conference hosted in Guangzhou.We had an amazing time meeting with like-minded professionals from around Asia and beyond. Here at Agenda Consulting, we are always expanding our knowledge and learning about new trends and practices in the international and bilingual school environment."
  },
  {
    "id": "03",
    "date": "2019-11-15",
    "title": "Sharing International Schools’ Best Practices and Trends in Bahrain",
    "image": "/news/Best_Practice_Trends_Bahrain-1.jpg",
    "content": "Every school has something very unique and compelling to offer, however identifying and delivering those attributes in the right way is the key to standing out from the rest in the international school marketing. Agenda Consulting recently hosted a Best Practice Trends Workshop in Bahrain with our founder Alex Gibbs – here is what he had to say:",
    "quote": "The popularity of international school education is growing throughout the world increasing the competitive standards of all schools. The Middle East is an emerging market, and Bahrain continues to broaden its international schooling landscape offering parents a wider variety of choice for their children.<br><br>I believe every school has something very different to offer. Recognising a school’s unique strengths – within teaching and pedagogy, curriculum and course offering, wellbeing and guidance, arts, sports and other activities – provides the framework for effective marketing within a school.<br><br>I am always excited by sharing knowledge in the workshops we do here at Agenda, with Bahrain being no exception. I was very impressed by the knowledge of participants and their willingness to share challenges and ideas with each other. I always encourage further sharing and learning from members of the international school community, like the saying goes ‘all boats will rise with the tide."
  },
  {
    "id": "04",
    "date": "2019-02-20",
    "title": "Another AIA Carnival complete!",
    "image": "/news/AC.jpg",
    "innerTitle": "This year we took on the role of developing a new look for the 5th year edition of the event, making it refreshing, exciting and relevant.",
    "content": "After months of consumer research driven by a young group of staff, we launched an out of the world, modern, space theme rebrand of the traditional European Styled Carnival. Together with a new integrated marketing strategy combining OOH, digital and onsite marketing, we were able to successfully achieve record attendance, awareness and revenue. We look forward to being back next year with Hong Kong’s most loved Carnival."
  },
  {
    "id": "05",
    "date": "2019-11-07",
    "title": "Digital Design Days in Milan",
    "image": "/news/GroupPhoto-751x1024.jpg",
    "content": "South Central Media headed to the Digital Design Days conference in Milan, Italy last month to gather with likeminded experienced designers from worldwide famed brands including MediaMonks, Spotify, Buck and Rodeo FX among others, to share and generate ideas on about contemporary design trends. Every piece of empowering insight shared during the session inspired our team to strive further as a group of continuously improving and adapting creators."
  },
  {
    "id": "06",
    "date": "2019-03-24",
    "title": "Agenda’s winning campaigns for Event Marketing Awards 2019",
    "image": "/news/DSC05108-2-e1598635922303-1024x712.jpg",
    "innerTitle": "We are beyond grateful to be awarded Gold for Best Sponsorship and Bronze for Best Integrated Marketing from the Asia Pacific Event Marketing Awards 2019!",
    "content": "Our community-inclusive approach and aim to activate AIA’s brand promise for “Hong Kong Observation Wheel and AIA Vitality Park” has prompted the people of Hong Kong to actively improve their lifestyles. Moreover, “Celebrating 5 years of the AIA Carnival” was our mission to rebrand one of Hong Kong’s staple Winter events by incorporating a refreshing and relevant strategy to the traditional European-styled Carnival. Winning these honours wouldn’t have been possible without the support of our partner Great Entertainment Group, The Entertainment Corporation Limited, AIA, and the people of Hong Kong. It’s been our absolute pleasure to enhance one of Hong Kong’s iconic landmark and bring to life the Central Harbourfront!"
  },
  {
    "id": "07",
    "date": "2018-10-03",
    "title": "South Central works with AIA and David Beckham to launch new brand promise",
    "image": "/news/DB-1024x574-1.jpg",
    "innerTitle": "Bringing the promise to life with multimedia content",
    "content": "It was a pleasure to be working once again with AIA and David Beckham for the launch of their new brand promise: Healthier, Longer, Better Lives. To embody the new brand promise, a week’s worth of healthy living activities was made available at the heart of Hong Kong, the Hong Kong Observation Wheel & AIA Vitality Park. The activities included wellness classes, cooking classes, musical showcases, community activities, and even football coaching clinics.<br><br>South Central Media was entrusted to ensure the festivities and activities were captured through engaging and meaningful video content. These variety of activities meant that we had to carefully plan our production schedule and implement new filming techniques. While we worked with many prominent figures during the shoot such as Tottenham Hotspur Coaches, Chef Jeremy Pang and Mr Wally, being able to work with David Beckham again was definitely the highlight for the team. Here is the final production recapping the launch & activities!"
  },
  {
    "id": "08",
    "date": "2019-02-12",
    "title": "Creating extraordinary experiences in the most ordinary of places – the supermarket.",
    "image": "/news/circus-x-parknshop-49-1-1-1024x1024.jpg",
    "content": "From researching for the perfect locations to coming up with a creative storyboard, it was an incredible experience for us to film this short video for The Great Circus of Europe and ParknShop.<br><br>To bring the magic of the circus to life at the supermarket, we first took time to understand each of the circus performers and their mesmerising acts, and how best to incorporate them in the video. The contortionist for example could walk on his hands even with his legs folded behind his back, which was perfect to be paired with little kids cheering him on.<br><br>Facing challenges such as working in the supermarket during operating hours and directing performers who spoke multiple languages, we managed to overcome the obstacles and turn them into opportunities. We certainly had a lot of fun thinking outside the box in order to make the performers stand out whiles highlighting the premium shopping experience at ParknShop.",
    "video_link": "",
    "video_title": "",
    "video_des": ""
  },
  {
    "id": "09",
    "date": "2018-07-25",
    "title": "Agenda wins Gold at Marketing Events Awards 2018",
    "image": "/news/CW-0719-0052-1024x683.jpg",
    "innerTitle": "We are thrilled to receive a coveted Gold Award at the Marketing Events Awards last night!",
    "content": "We are thrilled to receive a coveted Gold Award at the Marketing Events Awards last night!<br><br>Our winning entry was in the Best Outdoor Event (Health and Fitness) category for the campaign “AIA Vitality Park at The Hong Kong Observation Wheel”. In addition we were also recognised as a finalist in the Best Use of Venue Category. We are delighted to be part of the team and work alongside The Entertainment Corporation Limited and AIA in making AIA Vitality Park a world-class venue for all to enjoy. Knowing that the Hong Kong public is actively engaging in the wellness-related classes and events is encouraging and certainly represents a recognition of our joint effort!"
  }
]
