[
  {
    "id": "aia-carnival",
    "title": "AIA Carnival",
    "innerTitle": "AIA Carnival",
    "intro": "Integrated marketing to entice an audience",
    "intro_paragraph": "At Agenda Consulting, we are proud of the long-standing relationships we have with our clients because we believe they are testament to our ability to deliver.<br><br>One such partnership is with the AIA Carnival, a highly anticipated annual event.<br><br>We are responsible for all aspects of the Carnival’s marketing strategy and execution. Our objective is to ensure the event maintains high engagement and continues to draw a large audience every year.",

    "image": "/projects/carnival_main.png",
    "tags": ["event", "production", "corporate", "marketing"],
    "services": [
      "video production",
      "graphic design",
      "above the line media",
      "digital marketing",
      "Strategic campaign planning",
      "Public relations",
      "Design and branding",
      "Onsite design production",
      "Cinematography",
      "Charitable partnerships",
      "Community affairs"
    ],
    "isFeature": [true, 1],
    "features": [
      {
        "title": "Putting the audience first",
        "paragrah": "The demographic for the Carnival is broad. From teenagers and young families to professionals and corporate partners.<br><br>Understanding the audience forms a key component of the marketing and communications strategy.<br><br>We develop and execute high-reach strategies which incorporate our digital marketing expertise to drive conversion of the most valuable segments.<br><br>Using eye-catching promotional content which speaks to the diverse audience, we generate hype and anticipation.",
        "image": "01.png"
      },
      {
        "title": "Meaningful results",
        "paragrah": "In our latest strategy, we created impact by putting the audience at the forefront of our materials.<br><br>We designed feel-good content that tugs on the heart strings and showcases the fun and enjoyment the Carnival brings. The integrated strategy encompassed videos, social media, digital banners and publisher content which were curated to tell the stories of the many faces of the AIA Carnival.<br><br><ul style=\"list-style-type: circle;list-style-position: inside;\"><li>3.2 Mil people reached online</li><li>97% Visitor Satisfaction</li><li>Record attendance, awareness and revenue</li></ul>",
        "image": "02.png"
      }
    ],
    "video": "https://vimeo.com/323384286?embedded=true&source=video_title&owner=49772610"
  },
  {
    "id": "cis",
    "title": "CIS",
    "innerTitle": "Chinese International School",
    "intro": "Chinese International School - Strategic comms and engagement using video",
    "intro_paragraph": "<h2 style=\"font-size:1.8rem; line-height:1.2em\"><strong>Strategic comms and engagement using video</strong></h2><br>With an upcoming change in Senior Leadership, the school was looking for an unique way to engage their community and showcase the unique stories and personalities of their staff and alumni.<br><br>We helped launch a 18 part video series that provided insights into the unique stories and personalities of staff members. This even involved a trip to their Hangzhou campus last year for an extended special project. As the series received strong positive response from key stakeholders, it has been further extended and now also profiles key CIS alumni.",
    "services": [
      "video production",
      "Onsite design production",
      "Community affairs"
    ],
    "tags": ["education", "marketing"],
    "features": [
      {
        "title": "‘I am CIS’",
        "paragrah": "In this ‘I am CIS’ video we hear from Computer Science teacher, Jake Stephens. He shares his journey from growing up on a farm in Iowa, to discovering his love for teaching and his life’s purpose to positively impact all his students’ learning.",
        "image": "01.jfif"
      },
      {
        "title": "Positive Responses",
        "paragrah": "The strong viewership by the community and the positive responses and comments from parents and staff demonstrate the power of video to share the school’s message and engage its community.",
        "image": "02.jfif"
      }
    ],
    "video": "https://vimeo.com/246384406?embedded=true&source=video_title&owner=49772610",
    "image": "/projects/cis.png",
    "isFeature": [true, 2]
  },
  {
    "id": "the-lion-king",
    "title": "The Lion King",
    "innerTitle": "The Lion King Musical",
    "intro": "Celebrating a milestone with the community",
    "intro_paragraph": "<h2 style=\"font-size:1.8rem; line-height:1.2em\"><strong>Celebrating a milestone with the community</strong></h2><br>Disney’s The Lion King Musical was brought to Hong Kong for the first time in celebration of AIA Group’s centennial. The partnership tied in well with the Group’s brand promise to help people live healthier, longer, better lives and provided the perfect platform for meaningful stakeholder engagement.<br><br>The key messages linked AIA’s brand promise with The Lion King’s ‘Circle of Life’ theme. Just as the production follows the stages of life, so too does AIA through insurance protection at all life stages.",
    "image": "/projects/tlk.jpg",
    "tags": ["corporate", "production"],
    "isFeature": false,
    "video": "https://vimeo.com/382578104?embedded=true&source=video_title&owner=49772610",
    "features": [
      {
        "title": "Meaningful engagement",
        "paragrah": "Agenda Consulting set out to support the collaboration to meaningfully engage the local community. We helped to develop a programme of unique experiential and educational opportunities for community groups, students and underprivileged people in Hong Kong through ticket distribution and educational workshops.",
        "image": "01.jpg"
      },
      {
        "title": "Employee engagement and corporate entertainment",
        "paragrah": "The collaboration provided an opportunity to entertain customers and prospects, helping to drive lead generation and support relationship-building.<br><br>Employees were offered complimentary tickets to see the show, promoting employee engagement and retention.",
        "image": "02.jpg"
      },
      {
        "title": "The results",
        "paragrah": "<ul style=\"list-style-type: circle;list-style-position: inside;line-height:1.8em\"><li>The community engagement and education programme welcomed 580 participants from local schools and charities</li><li>Over 75,000 people experienced the magic of The Lion King</li><li>Video content gained 207,000 views and 120,000 engagements across multiple social channels</li><li>The campaign featured prominently in local media with AIA’s engagement mentioned</li>",
        "image": "03.jpg"
      },
      {
        "title": "Community engagement",
        "paragrah": "We created impact through:<ul style=\"list-style-type: circle;list-style-position: inside;line-height:1.8em\"><li>An early release video teaser amplified through multiple parties’ owned channels</li><li>Production of bespoke content to highlight the cast’s health and wellness routine and support the newly released Sleep Sufficiency programme and Vitality proposition</li><li>Animation production to promote the collaboration</li><li>Interviews with the cast and students from the Hong Kong Youth Arts Foundation (HKYAF). Designed for social distribution to tell the cast’s real life stories and inspire the next generation.</li>",
        "image": "04.jpg"
      }
    ],
    "services": ["Marketing Strategy", "Video Production", "Graphic Design"]
  },
  {
    "id": "hkow",
    "title": "HKOW",
    "innerTitle": "Hong Kong Observation Wheel",
    "intro": "Hong Kong Observation Wheel - Full spectrum marketing to relaunch an icon",
    "intro_paragraph": "Under new management, The Hong Kong Observation Wheel benefited from a number of enhancements, including the creation of an active lifestyle hub providing free fitness and wellness classes for all to enjoy. Tickets were also reduced to an affordable HK$20.<br><br>With these improvements, the attraction was more accessible to both local and foreign visitors, elevating the Wheel to become an iconic world-class attraction.<br><br>Agenda Consulting was appointed the agency responsible for all marketing, communications and public relations for the Wheel and its events.",
    "image": "/projects/wheel.jpg",
    "tags": ["marketing", "event", "production"],
    "isFeature": [true, 4],
    "video": "https://vimeo.com/488384503?embedded=true&source=video_title&owner=49772610",
    "features": [
      {
        "title": "Clear messaging",
        "paragrah": "Agenda deployed a two-pronged strategy to meet the Wheel's objectives.<br><br>A comprehensive public relations plan was developed and supported by strategic media planning.<br><br>Carefully curated video content and high-quality imagery were used to showcase what the Wheel had to offer. The message was clear and inspiring. The harbour views and range of fitness classes helped to encourage attendees to visit the attraction and experience it for themselves.",
        "image": "01.jpg"
      },
      {
        "title": "Award winning results",
        "paragrah": "The coordinated campaign achieved an astonishing response from the public, far exceeding its targets. Demand for the attraction was high and news about the reopening featured in several notable publications.<br><br>Within the first year, more than two million visitors rode the wheel, double the target of the previous operator. The fitness and wellness activities were also a hit. All classes were fully booked with attendance from over 6,800 participants.<br><br>The Wheel and AIA Vitality Park is become an established active lifestyle hub on the Central Harbourfront. It continues to expand its offering and also features other lifestyle events.<br><br>The relaunch campaign was recognised for masterful execution and was awarded Gold, the highest distinction, for four highly coveted marketing awards.",
        "image": "02.jpg"
      }
    ],
    "services": [
      "Campaign planning",
      "Digital marketing",
      "Event management",
      "Media buying",
      "Public relations",
      "Content production"
    ]
  },
  {
    "id": "wheel-ar",
    "title": "AR App for HKOW",
    "innerTitle": "Augmented Reality App for the Wheel",
    "intro": "Cutting-edge technology and creativity",
    "intro_paragraph": "<h2 style=\"font-size:1.8rem; line-height:1.2em\"><strong>Cutting-edge technology and creativity</strong></h2><br>Our team are committed to staying at the forefront of creative and technological advancements to continually bring our clients fresh and innovative ideas. That’s why we attend the Digital Design Days conference in Milan every year.<br><br>At our last visit we conceptualised our latest idea to drive engagement for the Hong Kong Observation Wheel and connect the iconic landmark to its place in history.",
    "image": "/projects/ar_app.jpg",
    "tags": ["production"],
    "isFeature": [true, 3],
    "features": [
      {
        "title": "A world-first",
        "paragrah": "We designed and launched an augmented reality (AR) app, bringing to life bygone eras. The app is the first of its kind to be developed for use on a moving platform. It enables users to learn more about Hong Kong’s rich history through stunning visuals and interactive features.<br><br>Cillum consequat ea elit ex amet cillum ex tempor adipisicing duis. Consequat sit ea amet occaecat.Veniam ea fugiat esse laboris elit labore commodo do mollit elit cillum aliqua. Ipsum elit commodo veniam dolore aliqua est quis qui labore duis tempor cupidatat proident voluptate. Officia Lorem commodo sunt qui amet eu nulla occaecat ad culpa ullamco non est officia.",
        "image": "01.jpg"
      },
      {
        "title": "Global expertise and collaboration",
        "paragrah": "The revolving wheel presented added complexities but we were unperturbed. We collaborated with experts from across the globe including Italy, the US and Australia to bring our vision to life.<br><br>We worked closely with local historians and the nearby Hong Kong Maritime Museum to accurately portray the different eras. We used visual records, maps and models to create true representations and transport users back in time.<br><br>By focusing on the details and reconstructing assets we developed a truly immersive experience to drive engagement and a deeper connection.",
        "image": "02.jpg"
      }
    ],
    "services": [
      "Campaign planning",
      "Digital marketing",
      "Media buying",
      "Public relations",
      "Content production",
      "Event management"
    ]
  },
  {
    "id": "the-grounds",
    "title": "The Grounds",
    "innerTitle": "The Grounds",
    "intro": "Strategic comms and engagement using video",
    "intro_paragraph": "The Grounds at AIA Vitality Park is Hong Kong’s ultimate socially distant entertainment experience, located on the vibrant Central Harbour front.<br><br>The concept was developed during the pandemic to offer a selection of entertainment options such as movies, live music, family activities, wellness classes and much more for attendees to enjoy from the comfort and safety of their own private pods.",
    "image": "/projects/The-Grounds-logo.jpg",
    "tags": ["marketing", "production", "corporate", "event"],
    "isFeature": false,
    "video": "https://vimeo.com/488389456?embedded=true&source=video_title&owner=49772610",
    "features": [
      {
        "title": "Bringing the pieces together",
        "paragrah": "Together with our in-house creative experts, we partnered with the team behind the Grounds to brand and market the concept.<br><br>As a completely new proposition, we developed the branding from scratch. We sought to portray a premium but inclusive offering which was flexible for a mass audience as well as private events.<br><br>Our talented creative team developed a series of animations to showcase the offering and bring it to life.<br><br>The launch was a huge success with sell out listings across the board.",
        "image": "01.jpg"
      },
      {
        "title": "Putting the audience first",
        "paragrah": "The demographic for the Carnival is broad. From teenagers and young families to professionals and corporate partners.<br><br>Understanding the audience forms a key component of the marketing and communications strategy.<br><br>We develop and execute high-reach strategies which incorporate our digital marketing expertise to drive conversion of the most valuable segments.<br><br>Using eye-catching promotional content which speaks to the diverse audience, we generate hype and anticipation.",
        "image": "02.jpg"
      }
    ],
    "services": [
      "Campaign planning",
      "Digital marketing",
      "Media buying",
      "Public relations",
      "Content production"
    ]
  },
  {
    "id": "aia-branding",
    "title": "AIA",
    "innerTitle": "AIA Branding",
    "intro": "A long standing relationship",
    "intro_paragraph": "<h2 style=\"font-size:1.8rem; line-height:1.2em\"><strong>A long standing relationship</strong></h2><br>We were first engaged to capture Beckham’s AIA Healthy Living Tour in Asia back in 2017.Since then AIA and Beckham’s team has continued to put their trust in us as their first choice of production team for all his Asia tours including Cambodia, Vietnam, Singapore and Thailand.<br><br><ul style=\"list-style-type: circle;list-style-position: inside;\"><li>2.6M+ views on David Beckham AIA Vietnam Event Social Media Video</li><li>Trusted Asian Partner to David Beckham’s Personal Team</li></ul>",
    "image": "/projects/aia.jpeg",
    "tags": ["corporate", "production"],
    "isFeature": false,
    "services": [
      "video production",
      "Onsite design production",
      "Community affairs",
      "Cinematography"
    ],
    "video": "https://vimeo.com/298354298?embedded=true&source=vimeo_logo&owner=49772610",
    "features": [
      {
        "title": "Strong partnership",
        "paragrah": "Due to our close relationship throughout the year working on the Carnival, Hong Kong Observation Wheel and AIA Vitality Park we meet as a working group every fortnight.<br><br>This has enabled us to build a strong, trusted relationship, breaking down barriers and enabling us to engage as a member of the team.",
        "image": "01.jpg"
      },
      {
        "title": "Award winning results",
        "paragrah": "Our close working relationship has continually allowed us to exceed expectations and set new milestones. We have been humbled that our hard work and collaboration has received external recognition through multiple awards over the years.",
        "image": "02.jpeg"
      }
    ]
  },
  {
    "id": "kellett-school",
    "title": "Kellett School",
    "innerTitle": "Kellett School",
    "intro": "Strategic review, training and fundraising",
    "intro_paragraph": "<h2 style=\"font-size:1.8rem; line-height:1.2em\"><strong>Strategic review, training and fundraising</strong></h2><br>Our relationship with Kellett began with a complete Marketing and Communications Review, which assessed the ongoing and upcoming functions and needs of their Development Office.<br><br>As a follow up to this we held various training and workshops for their staff to identify their strategic direction and key communication points.<br><br>As part of a year long support we assisted them on various projects including the preparation, launch and execution of their Annual Fund.",
    "image": "/projects/ks.jpg",
    "tags": ["education", "production"],
    "isFeature": false,
    "services": [
      "Marketing and communications review",
      "Training and workshops",
      "Community engagement and affairs",
      "Fundraising"
    ],
    "features": [
      {
        "title": "Results",
        "paragrah": "Ad aliquip aute exercitation occaecat incididunt elit non Lorem amet sunt quis. Exercitation qui in nisi elit culpa consectetur incididunt. Elit dolor quis sit commodo pariatur qui duis nisi laboris mollit quis commodo labore cillum. Ex non do veniam sit minim fugiat est reprehenderit. Anim consectetur eu tempor amet excepteur pariatur eiusmod labore velit aliquip nisi culpa. Sunt anim excepteur aliqua occaecat quis voluptate ipsum. Commodo exercitation qui do dolor proident nostrud commodo in nulla.",
        "image": "01.png"
      },
      {
        "title": "From Robbie Irvine",
        "paragrah": "'In all of our dealings with Agenda Consulting they have consistently provided Kellett School with a highly professional and flexible service to meet our needs whether short-term operational or more long-term strategic in nature. Their ability to draw upon the experience of working with a number of school clients was obviously a key selling point in us engaging them, but to their extreme credit they are highly diligent and conscientious on focussing on one’s own operating environment and specific circumstances and in tailoring their advice and recommendations with real objectivity.'",
        "image": "02.jpg"
      }
    ]
  },
  {
    "id": "stem",
    "title": "STEM at Carnival",
    "innerTitle": "STEM at the AIA Carnival",
    "intro": "Community affairs to build tomorrow’s leaders",
    "intro_paragraph": "<h2 style=\"font-size:1.8rem; line-height:1.2em\"><strong>Community affairs to build tomorrow’s leaders</strong></h2><br>In our continued pursuit to drive greater social purpose, we combined our expertise in education and our ongoing work with the Great European Carnival to launch our latest community outreach programme - STEM at the AIA Carnival.<br><br>We worked closely with students from the Faculty of Education at the Hong Kong University and instructors from Techbob Academy to develop a relevant and engaging programme to inspire the next generation of STEM leaders.",
    "image": "/projects/stem.jpg",
    "tags": ["education", "production"],
    "isFeature": false,
    "services": ["Marketing Strategy", "Event Planning", "Graphic Design"],
    "features": [
      {
        "title": "Long-term impact",
        "paragrah": "Tesla, the programme's official partner, gave students the opportunity to learn how electric cars run and discuss the environmental benefits of having zero-emissions cars. The AIA Carnival acted as a huge outdoor classroom and provided a platform for aspiring teachers to develop their skills.",
        "image": "01.jpg"
      },
      {
        "title": "Positive Responses",
        "paragrah": "Over 3,000 students from more than 60 schools visited the Carnival where they learnt about the scientific principles behind the rides while enjoying a great day out. The initiative attracted media attention and was featured in publications such as The Standard.",
        "image": "02.jpg"
      }
    ]
  },
  {
    "id": "pnk-circus",
    "title": "PnK x Great Circus of Europe",
    "innerTitle": "ParknShop and the Great Circus of Europe",
    "intro": "Bringing magic and mischief to a household name",
    "intro_paragraph": "It’s no secret we are advocates of event sponsorship. In addition to driving awareness, we believe strategic partnerships are a powerful tool for community affairs and engagement.<br><br>ParknShop agree and they set out to achieve just that by sponsoring the Great Circus of Europe.<br><br>The retailer established a reward programme to engage shoppers and incentivise in-store spending. In recognition, customers received discounts for tickets to the highly anticipated annual Carnival.<br><br>We were on hand with the support of our in-house creative team to bring magic and intrigue to the campaign.",
    "services": ["Video Production", "graphic design", "Marketing Strategy"],
    "image": "/projects/circus.jpg",
    "tags": ["marketing", "corporate", "event", "production"],
    "isFeature": false,
    "video": "https://vimeo.com/314705430?embedded=true&source=video_title&owner=49772610",
    "features": [
      {
        "title": "Attention shoppers",
        "paragrah": "We produced a viral video steeped in mischief, where the Circus Ring Leader attempts to catch the acts among the aisles of tantalising produce. Clowns, acrobats and strongmen dart around the store.<br><br>We took care of everything from creative storyboarding and location scouting to successfully orchestrate the circus-meets-supermarket concept.",
        "image": "01.jpg"
      },
      {
        "title": "Meaningful results",
        "paragrah": "The video is captivating and entertaining while cleverly showcasing ParknShop’s product range.<br><br>The message to the audience - ‘catch them before they are gone’ - is both a reference to the duration of the Carnival and a call-to-action.<br><br>The video reached over 265,000 people, achieving a healthy rate of engagement of 9%. Overall, the campaign contributed significantly to strong onsite brand recognition and high uptake of tickets. ParknShop was so pleased with the success of the video that another video was produced for the following year, this time featuring an all new circus line up.",
        "image": "02.jpg"
      }
    ]
  }
]
