[
  {
    "url": "/staff/Alex.jpg",
    "name": "Alex Gibbs",
    "title": "Founder& Managing Director",
    "intro": "With over 20 years experience in marketing, entertainment, school development, and fundraising, Alex now consults to many leading event producers and international schools in Asia. He has also been a regular speaker and trainer at conferences and workshops throughout Australasia for more than a decade. Alex is also a surf aficionado and on weekends can be found catching waves in Sai Kung.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  },
  {
    "url": "/staff/Rochelle.jpg",
    "name": "Rochelle Bargo",
    "title": "Creative Director",
    "intro": "A multimedia guru with a keen eye, Rochelle has a strong international creative background working in US cities such as San Francisco, Oakland, Portland and Eugene, as well as Hong Kong. Her experience in entertainment, education and fund raising campaigns makes her a formidable opponent. She has a fur kid named Fynn which she spoils excessively.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  },
  {
    "url": "/staff/Matthew.jpg",
    "name": "Matthew Yau",
    "title": "Account Manager",
    "intro": "Matt is highly-organised and passionate about getting the best results for his campaigns. Well-versed in campaign strategy, public relations, digital marketing & analytics, he has a well rounded marketing background. He has a sweet tooth, especially for cookies, which he balances out with wake surfing.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  },
  {
    "url": "/staff/Andrew.png",
    "name": "Andrew Lau",
    "title": "Cinematographer",
    "intro": "Andrew is a Canadian cinematographer and filmmaker with a background in television, film, documentaries, and commercials. He holds a bachelor's degree in architecture as well as a certificate in film studies. His diverse background provides him with a distinct approach and perspective to any project he works on. His films have been screened and awarded at numerous international festivals and exhibitions.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  },
  {
    "url": "/staff/Joseph.jpg",
    "name": "Joseph Chan",
    "title": "Digital Marketing Executive",
    "intro": "A double threat in English & Chinese copywriting, Joseph also knows his way around all sorts of digital marketing tools. He also loves cooking and baking healthy treats.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  },
  {
    "url": "/staff/Louisa.png",
    "name": "Louisa Tang",
    "title": "Administrative Manager",
    "intro": "Louisa joined Agenda in 2020 bringing with her over 15 years of experience across sectors such as Human Resources, Legal, and Property. She is responsible for the administration, finance, and functional operation of the Agenda office. During her free time, Louisa enjoys scuba diving and skiing.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  },
  {
    "url": "/staff/Eva.jpg",
    "name": "Eva Ma",
    "title": "Graphic Designer",
    "intro": "Resident design expert & fashionista Eva believes in going the extra mile to ensure aesthetics are well crafted. It is no wonder she expresses her philosophy through to her daily outfits.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  },
  {
    "url": "/staff/Roda.jpg",
    "name": "Roda Mei Bargo",
    "title": "Motion Graphic Designer",
    "intro": "Roda is highly skilled in Adobe products and quirky illustrator. Give her an idea and she will bring it to life. She is also a big fan of cartoons and all things cute.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  },
  {
    "url": "/staff/Jen.png",
    "name": "Jen Choi",
    "title": "Motion Graphic Designer",
    "intro": "Jen is our go-to artist for all things 3D. Thriving from generating new techniques and reducing the bridge between live action and VFX, Jen creates realistic renders and animations for marketing campaigns and digital promotions.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  },
  {
    "url": "/staff/Mohnish.png",
    "name": "Mohnish Daryanani",
    "title": "Videographer",
    "intro": "Mohnish is a passionate creative who never says no to a challenge and will always come up with a creative way to solve unforeseen problems. His passion lies in videography but spends his free time improving his photography skill, frequently taking portraits and experimenting with different styles.",
    "socialMedia": [
      ["Facebook", "https://www.facebook.com"],
      ["Instagram", "https://www.instagram.com"],
      ["Linkined", "https://www.linkined.com"]
    ]
  }
]
